<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of zoom.us and uploads the package to your JSS.</string>
	<key>Identifier</key>
	<string>com.github.jdaileybuf.jss-upload.zoom.us</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>NAME</key>
		<string>zoom.us</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jdaileybuf.pkg.zoom.us</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/zoom.us.app/Contents/Info.plist</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleVersion</key>
					<string>version</string>
					<key>CFBundleShortVersionString</key>
					<string>jamfversion</string>
					<key>LSMinimumSystemVersion</key>
					<string>min_os_version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>PATCH_ENABLED</key>
				<string>false</string>
				<key>PATCH_NAME</key>
				<string>%NAME%</string>
				<key>PATCH_SOFTWARE_TITLE</key>
				<string>Zoom Client For Meetings</string>
				<key>PATCH_TEMPLATE</key>
				<string>PatchTemplate-automatic.xml</string>
				<key>POLICY_NAME</key>
				<string>%NAME% Update</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_name</key>
				<string>%NAME%-%jamfversion%.pkg</string>
				<key>version</key>
				<string>%jamfversion%</string>
				<key>patch_name</key>
				<string>%PATCH_NAME%</string>
				<key>patch_softwaretitle</key>
				<string>%PATCH_SOFTWARE_TITLE%</string>
				<key>patch_template</key>
				<string>%PATCH_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPatchUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/expanded</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
